(require 'quail)

(quail-define-package
  "jdp-urd" "UTF-8" "urd<" t
  "Urdu input method."
  nil t nil nil nil nil nil nil nil nil t)

(quail-define-rules
("" "ا")
("" "آ")
("" "ب")
("" "پ")
("" "ت")
("" "ٹ")
("" "ث")
("" "ج")
("" "چ")
("" "ح")
("" "خ")
("" "د")
("" "ڈ")
("" "ذ")
("" "ر")
("" "ڑ")
("" "ز")
("" "ژ")
("" "س")
("" "ش")
("" "ص")
("" "ض")
("" "ط")
("" "ظ")
("" "ع")
("" "غ")
("" "ف")
("" "ق")
("" "ک")
("" "گ")
("" "ل")
("" "م")
("" "ن")
("" "ں")
("" "و")
("" "ہ")
("" "ھ")
("" "ی")
("" "ے")

("_" "ّ"); tashdid
("_" "ٗ"); inverted damma
("_" "ٰ"); subscribed alif
("i" "ِ"); zer
("u" "ُ"); pesh
("a" "َ"); zabar
("_" "ً"); tanwin-an
("_" "٘ "); subscribed nun gunna

("" "ٿ")
("" "ڐ")
("" "ڙ")

("" "ؤ")
("" "ئ")
("" "ۓ")
("" "ء")

("_" "ـ")
("." ".")
("," "،")
(";" "؛")
("!" "!")
("?" "؟")

("0" "۰")
("1" "۱")
("2" "۲")
("3" "۳")
("4" "۴")
("5" "۵")
("6" "۶")
("7" "۷")
("8" "۸")
("9" "۹")
)

(provide 'jdp-urd)
