(require 'quail)

(quail-define-package
  "jdp-chu" "UTF-8" "chu<" t
  "Church Slavonic input method."
  nil t nil nil nil nil nil nil nil nil t)

;; https://ponomar.net/cukeyb2.html

(quail-define-rules
("A" "А")
("a" "а")
("B" "Б")
("b" "б")
("V" "В")
("v" "в")
("G" "Г")
("g" "г")
("D" "Д")
("d" "д")
("E" "Е")
("e" "е")
("" "є")
("" "Ж")
("" "ж")
("" "Ѕ")
("" "ѕ")
("Z" "З")
("z" "з")
("" "ꙁ")
("I" "И")
("i" "и")
("" "Й")
("" "й")
("" "І")
("" "і")
("" "Ї")
("" "ї")
("K" "К")
("k" "к")
("L" "Л")
("l" "л")
("M" "М")
("m" "м")
("N" "Н")
("n" "н")
("O" "О")
("o" "о")
("" "Ѻ")
("" "ѻ")
("" "Ѡ")
("" "ѡ")
("" "Ѿ")
("" "ѿ")
("P" "П")
("p" "п")
("R" "Р")
("r" "р")
("S" "С")
("s" "с")
("T" "Т")
("t" "т")
("U" "У")
("u" "ᲂ")
("" "у")
("" "Ꙋ")
("" "ꙋ")
("F" "Ф")
("f" "ф")
("H" "Х")
("h" "х")
("C" "Ц")
("c" "ц")
("" "Ч")
("" "ч")
("" "Ш")
("" "ш")
("" "Щ")
("" "щ")
("" "Ъ")
("" "ъ")
("Y" "Ы")
("y" "ы")
("" "Ь")
("" "ь")
("" "Ѣ")
("" "ѣ")
("" "Ю")
("" "ю")
("" "Ꙗ")
("" "ꙗ")
("" "Ѧ")
("" "ѧ")
("" "Ѽ")
("" "ѽ")
("" "Ѫ")
("" "ѫ")
("" "Ѯ")
("" "ѯ")
("" "Ѱ")
("" "ѱ")
("" "Ѳ")
("" "ѳ")
("" "Ѵ")
("" "ѵ")
("" "Ѷ")
("" "ѷ")

;; diacritical marks

("" "́")  ;; оксия
("" "̀")  ;; вария
("" "̑") ;; камора
("" "҆") ;; звательце
("" "҆́") ;; исо
("" "҆̀") ;; апостроф
("" "҃") ;; титло
("" "̾") ;; ерок

;; letter titla

("" "ⷠ҇") ;; буки-титло
("" "ⷡ҇") ;; веди-титло
("" "ⷢ҇") ;; глагол-титло
("" "ⷣ")  ;; добро-титло
("" "ⷩ҇") ;; наш-титло
("" "ⷪ҇") ;; он-титло
("" "ⷬ҇") ;; рцы-титло
("" "ⷭ҇") ;; слово-титло
)

(provide 'jdp-chu)
