(require 'quail)

(quail-define-package
  "dpurge-hin" "UTF-8" "hin<" t
  "Hindi input method."
  nil t nil nil nil nil nil nil nil nil t)

(quail-define-rules
 ("0" "०") ("1" "१") ("2" "२") ("3" "३") ("4" "४")
 ("5" "५") ("6" "६") ("7" "७") ("8" "८") ("9" "९")

 ("k" "क") ("K" "ख") ("g" "ग") ("G" "घ") ("f" "ङ")
 ("c" "च") ("C" "छ") ("j" "ज") ("J" "झ") ("F" "ञ")
 ("t" "ट") ("T" "ठ") ("d" "ड") ("D" "ढ") ("N" "ण")
 ("w" "त") ("W" "थ") ("x" "द") ("X" "ध") ("n" "न")
 ("p" "प") ("P" "फ") ("b" "ब") ("B" "भ") ("m" "म")
 ("y" "य") ("r" "र") ("l" "ल") ("v" "व") ("S" "श")
 ("R" "ष") ("s" "स") ("h" "ह")

 ("a" "अ") ("`a" "अ") ("`A" ["आ"]) ("`i" ["इ"]) ("`I" ["ई"])
 ("`u" ["उ"]) ("`U" ["ऊ"]) ("`e" ["ए"]) ("`E" ["ऐ"])
 ("`o" ["ओ"]) ("`O" ["औ"]) ("`q" ["ऋ"]) ("`Q" ["ॠ"])
 ("`L" ["ऌ"]) ("`LY" ["ॡ"])

 ("`" "्") ("A" "ा") ("i" "ि") ("I" "ी") ("u" "ु")
 ("U" "ू") ("e" "े") ("E" "ै") ("o" "ो") ("O" "ौ")
 ("q" "ृ") ("Q" "ॄ") ("L" "ॢ") ("LY" "ॣ")

 ("z" "ँ") ("M" "ं") ("H" "ः") ("Z" "़")

 ("." "।") (".." "॥") ("..." "॰"))

(provide 'dpurge-hin)
