(require 'quail)

(quail-define-package
  "dpurge-hye" "UTF-8" "hye<" t
  "Armenian input method."
  nil t nil nil nil nil nil nil nil nil t)

(quail-define-rules
 ("A" "Ա") ("a" "ա")
 ("B" "Բ") ("b" "բ")
 ("G" "Գ") ("g" "գ")
 ("D" "Դ") ("d" "դ")
 ("E" "Ե") ("e" "ե")
 ("Z" "Զ") ("z" "զ")
 ("Ee" "Է") ("ee" "է")
 ("E`" "Ը") ("e`" "ը")
 ("Th" "Թ") ("th" "թ")
 ("Zh" "Ժ") ("zh" "ժ")
 ("I" "Ի") ("i" "ի")
 ("L" "Լ") ("l" "լ")
 ("X" "Խ") ("x" "խ")
 ("K" "Կ") ("k" "կ")
 ("H" "Հ") ("h" "հ")
 ("J" "Ձ") ("j" "ձ")
 ("M" "Մ") ("m" "մ")
 ("Y" "Յ") ("y" "յ")
 ("N" "Ն") ("n" "ն")
 ("O" "Ո") ("o" "ո")
 ("P" "Պ") ("p" "պ")
 ("S" "Ս") ("s" "ս")
 ("V" "Վ") ("v" "վ")
 ("T" "Տ") ("t" "տ")
 ("R" "Ռ") ("r" "ր")
 ("W" "Ւ") ("w" "ւ")
 ("F" "Ֆ") ("f" "ֆ")
 ("ew" "և")

 ("!" "՜")
 ("?" "՞")
 ("," "՝")
 ("." "։"))

(provide 'dpurge-hye)
